# RadioButtonGroupData Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RadioButtonGroupData Constructor
RadioButtonGroupData Class See Also
---
Constructs a new instance of RadioButtonGroupData.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public RadioButtonGroupData(
	string name
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String _
)
```

Visual C++
---
```text
public:
RadioButtonGroupData(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..StringThe internal name of the RadioButtonGroup.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is passed for name. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an empty string is passed for name. |

# See Also
RadioButtonGroupData Class
Autodesk.Revit.UI Namespace